RIET/src/Catalogs/Реестры/Реестры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Реестры</name>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Координатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияОтПодрядчика</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОказанияУслугНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОказанияУслугОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.ServiceProviders</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПлательщик</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.RegionProvince</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНесоблюденияСроков</name>
    <type>
      <types>CatalogRef.OutOfComplianceReasons</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФинализации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециалистБиллинга</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВозврата</name>
    <type>
      <types>CatalogRef.OutOfComplianceReasons</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФинализацииБиллингом</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНесоблюденияСроковБиллингом</name>
    <type>
      <types>CatalogRef.OutOfComplianceReasons</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлательщикиСписком</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричиныСписком</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричиныБиллингСписком</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Поставки</name>
    <attributes>
      <name>Поставка</name>
      <type>
        <types>DocumentRef.TripNonLawsonCompanies</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Плательщики</name>
    <attributes>
      <name>Плательщик</name>
      <type>
        <types>CatalogRef.SoldTo</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПричиныНесоблюденияСроков</name>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.OutOfComplianceReasons</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПричиныНесоблюденияСроковБиллинг</name>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.OutOfComplianceReasons</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПричиныВозврата</name>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.OutOfComplianceReasons</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/InformationRegisters/СтатусыРеестровLog/СтатусыРеестровLog.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыРеестровLog</name>
  <resources>
    <name>User</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Text</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>LogTo</name>
    <type>
      <types>CatalogRef.Реестры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>LogType</name>
    <type>
      <types>CatalogRef.LogTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Documents/RentalTrucksCostsSums/RentalTrucksCostsSums.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>RentalTrucksCostsSums</name>
  <registerRecords>AccumulationRegister.LocalDistributionCostsMilageWeightVolume</registerRecords>
  <registerRecords>AccumulationRegister.LocalDistributionCostsPerItem</registerRecords>
  <registerRecords>AccumulationRegister.InternationalAndDomesticFactCosts</registerRecords>
  <registerRecords>AccumulationRegister.LocalDistributionCostsPerKG</registerRecords>
  <registerRecords>AccumulationRegister.LocalDistributionAccessorialCostsPerItem</registerRecords>
  <attributes>
    <name>ServiceProvider</name>
    <type>
      <types>CatalogRef.ServiceProviders</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Comments</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalEntity</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </attributes>
  <attributes>
    <name>RegionProvince</name>
    <type>
      <types>CatalogRef.RegionProvince</types>
    </type>
  </attributes>
  <attributes>
    <name>RentalAutomatic</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>RentalTrucks</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DateTrip</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>TransportRequest</name>
      <type>
        <types>DocumentRef.TransportRequest</types>
      </type>
    </attributes>
    <attributes>
      <name>Trip</name>
      <type>
        <types>DocumentRef.TripNonLawsonCompanies</types>
      </type>
    </attributes>
    <attributes>
      <name>LegalEntity</name>
      <type>
        <types>CatalogRef.LegalEntities</types>
      </type>
    </attributes>
    <attributes>
      <name>Segment</name>
      <type>
        <types>CatalogRef.Сегменты</types>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Vehicle</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Cost</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>AccessorialCosts</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BaseCost</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Weight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Milage</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BaseCostCurrency</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Transport</name>
      <type>
        <types>CatalogRef.Transport</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщееЧислоДнейИспользования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>RentalTrucksManual</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>LegalEntity</name>
      <type>
        <types>CatalogRef.LegalEntities</types>
      </type>
    </attributes>
    <attributes>
      <name>Segment</name>
      <type>
        <types>CatalogRef.Сегменты</types>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Transport</name>
      <type>
        <types>CatalogRef.Transport</types>
      </type>
    </attributes>
    <attributes>
      <name>Vehicle</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Equipment</name>
      <type>
        <types>CatalogRef.Equipments</types>
      </type>
    </attributes>
    <attributes>
      <name>Cost</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>AccessorialCosts</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BaseCost</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Weight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Milage</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Volume</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BaseCostCurrency</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>LocationFrom</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
    <attributes>
      <name>LocationTo</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
    <attributes>
      <name>Duration</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>HazardClass</name>
      <type>
        <types>CatalogRef.HazardClasses</types>
      </type>
    </attributes>
    <attributes>
      <name>Geomarket</name>
      <type>
        <types>CatalogRef.GeoMarkets</types>
      </type>
    </attributes>
    <attributes>
      <name>BaseCostPercent</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CostBeforePercentApplying</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Hours_a_day</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>NumOfTrips</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщееЧислоДнейИспользования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AccessorialCosts</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CostType</name>
      <type>
        <types>CatalogRef.AccessorialCosts</types>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Sum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Catalogs/Реестры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция СформироватьИдентификаторРеестра(РеестрОбъект = Неопределено) Экспорт
	
	Номер = Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy") + " - " + СокрЛП(РеестрОбъект.Подрядчик);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Реестры.Ссылка) КАК КоличествоРеестров
	|ИЗ
	|	Справочник.Реестры КАК Реестры
	|ГДЕ
	|	Реестры.Наименование ПОДОБНО &Наименование
	|	И НЕ Реестры.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Наименование", Номер+"%");
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Результат.Следующий();
	
	Номер = Номер + "-" + (Результат.КоличествоРеестров + 1);
	
	Возврат Номер;
	
	//Префикс = "_SALAVAT-";
	//Возврат Формат(ТекущаяДата(), "ДФ=ddMMyyyy")+ Префикс + ПолучитьНомерРеестра();
	
КонецФункции

Процедура ЗаписатьЛоги(Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтрокаИсключаемыхРеквизитов = "Комментарий"; 
	ТекстИзменений = ImportExportСервер.РегистрацияИзмененийРеквизитовОбъекта(ТекущийОбъект, СтрокаИсключаемыхРеквизитов);
	
	Если ТекстИзменений = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.СтатусыРеестровLog.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.LogTo 	= ТекущийОбъект.Ссылка;
	МенеджерЗаписи.Date		= ТекущаяДата();	
	МенеджерЗаписи.LogType	= Справочники.LogTypes.ИзменениеРеквизитов;
	МенеджерЗаписи.User		= ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Text		= ТекстИзменений;	
	МенеджерЗаписи.Записать();
	// } RGS AArsentev 09.09.2016 16:56:30 S-I-0001717
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Процедура ЗаписатьЛогиПринудительно(Объект, ТекстИзменений) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТекстИзменений = Неопределено или ПустаяСтрока(ТекстИзменений) Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.СтатусыРеестровLog.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.LogTo 	= Объект.Ссылка;
	МенеджерЗаписи.Date		= ТекущаяДата();	
	МенеджерЗаписи.LogType	= Справочники.LogTypes.ИзменениеСтатуса;
	МенеджерЗаписи.User		= ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Text		= ТекстИзменений;	
	МенеджерЗаписи.Записать();
	// } RGS AArsentev 09.09.2016 16:56:30 S-I-0001717
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Функция СоздатьДокументRentalCosts(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реестры.ПериодОказанияУслугНачало КАК ДатаНачала,
	|	Реестры.ПериодОказанияУслугОкончание КАК ДатаОкончания,
	|	Реестры.Регион КАК RegionProvince,
	|	Реестры.Поставки.(
	|		Поставка
	|	),
	|	Реестры.Подрядчик как ServiceProvider 
	|ИЗ
	|	Справочник.Реестры КАК Реестры
	|ГДЕ
	|	Реестры.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Док = Документы.RentalTrucksCostsSums.СоздатьДокумент();
	Док.Дата = ТекущаяДата();
	
	ЗаполнитьЗначенияСвойств(Док, Результат[0]);
	
	Трипы = Результат[0].Поставки;
	
	Для каждого ТекТрип из Трипы Цикл 
		
		Стр = Док.RentalTrucks.Добавить();
		Стр.Trip = ТекТрип.Поставка;
		
	КонецЦикла;	
	
	Док.ОбменДанными.Загрузка = Истина;
	Док.Comments = "Создан автоматически на основании реестра " + Строка(Ссылка);
	Док.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат Док.Ссылка;
	
КонецФункции

Функция СоздатьДокументAPInvoice(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реестры.ПериодОказанияУслугНачало КАК ДатаНачала,
	|	Реестры.ПериодОказанияУслугОкончание КАК ДатаОкончания,
	|	Реестры.Регион КАК RegionProvince,
	|	Реестры.Поставки.(
	|		Поставка
	|	),
	|	Реестры.Подрядчик КАК ServiceProvider
	|ИЗ
	|	Справочник.Реестры КАК Реестры
	|ГДЕ
	|	Реестры.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Док = Документы.APInvoice.СоздатьДокумент();
	Док.Дата = ТекущаяДата();
	
	ЗаполнитьЗначенияСвойств(Док, Результат[0]);
	
	Трипы = Результат[0].Поставки;
	
	Для каждого ТекТрип из Трипы Цикл 
		
		Стр = Док.Trips.Добавить();
		Стр.Trip = ТекТрип.Поставка;
		
	КонецЦикла;	
	
	Док.ОбменДанными.Загрузка = Истина;
	Док.Comments = "Создан автоматически на основании реестра " + Строка(Ссылка);
	Док.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат Док.Ссылка;
	
КонецФункции
// работа с исходным реестром
Функция ИсходныйРеестрЗагружен(Реестр) Экспорт
	
	Если Реестр.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст  = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеестрыПрисоединенныеФайлы.Ссылка
	|ИЗ
	|	Справочник.РеестрыПрисоединенныеФайлы КАК РеестрыПрисоединенныеФайлы
	|ГДЕ
	|	РеестрыПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
	|	И РеестрыПрисоединенныеФайлы.Наименование = ""Original""
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеестрыПрисоединенныеФайлы.ДатаСоздания УБЫВ";
	
	Запрос.УстановитьПараметр("ВладелецФайла", Реестр);
	
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции

Функция ПолучитьОригинальныйРеестр(Реестр) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст  = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеестрыПрисоединенныеФайлы.Ссылка
	|ИЗ
	|	Справочник.РеестрыПрисоединенныеФайлы КАК РеестрыПрисоединенныеФайлы
	|ГДЕ
	|	РеестрыПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
	|	И РеестрыПрисоединенныеФайлы.Наименование = ""Original""
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеестрыПрисоединенныеФайлы.ДатаСоздания УБЫВ";
	
	Запрос.УстановитьПараметр("ВладелецФайла", Реестр);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат ПоместитьВоВременноеХранилище(ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(Результат.Ссылка));
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// работа с финальным реестром
Функция ФинальныйРеестрЗагружен(Реестр) Экспорт
	
	Если Реестр.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст  = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеестрыПрисоединенныеФайлы.Ссылка
	|ИЗ
	|	Справочник.РеестрыПрисоединенныеФайлы КАК РеестрыПрисоединенныеФайлы
	|ГДЕ
	|	РеестрыПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
	|	И РеестрыПрисоединенныеФайлы.Наименование = ""Final""
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеестрыПрисоединенныеФайлы.ДатаСоздания УБЫВ";
	
	Запрос.УстановитьПараметр("ВладелецФайла", Реестр);
	
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции

Функция ПолучитьФинальныйРеестр(Реестр) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст  = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеестрыПрисоединенныеФайлы.Ссылка
	|ИЗ
	|	Справочник.РеестрыПрисоединенныеФайлы КАК РеестрыПрисоединенныеФайлы
	|ГДЕ
	|	РеестрыПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
	|	И РеестрыПрисоединенныеФайлы.Наименование = ""Final""
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеестрыПрисоединенныеФайлы.ДатаСоздания УБЫВ";
	
	Запрос.УстановитьПараметр("ВладелецФайла", Реестр);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат ПоместитьВоВременноеХранилище(ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(Результат.Ссылка));
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура УведомитьПоЭлектроннойПочте(Адреса, Тема, Сообщение) Экспорт
		
	Если НЕ ЗначениеЗаполнено(Адреса) Тогда
		Возврат;
	КонецЕсли;
	
	РГСофт.ЗарегистрироватьПочтовоеСообщение(Адреса, Тема, Сообщение);
	
КонецПроцедуры

Функция ПолучитьРеестрДляТрипа(СсылкаНаТрип) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеестрыПоставки.Ссылка
	|ИЗ
	|	Справочник.Реестры.Поставки КАК РеестрыПоставки
	|ГДЕ
	|	РеестрыПоставки.Поставка = &Поставка";
	
	Запрос.УстановитьПараметр("Поставка", СсылкаНаТрип);
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		Возврат Рез.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

Функция ПолучитьНомерРеестра()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Реестры.Код КАК Код
	|ИЗ
	|	Справочник.Реестры КАК Реестры
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код УБЫВ";
	
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		
		Номер = Результат.Код;
		// удаление ведущих нулей
		Пока Лев(Номер, 1)="0" Цикл
			Номер = Сред(Номер, 2);
		КонецЦикла;
		Номер = Формат(Число(Номер) + 1, "ЧГ=0");
		Возврат Номер;
		
	Иначе
		Возврат 1;
	КонецЕсли;
	
КонецФункции

#КонецЕсли
